underwriter/app/controllers/users_controller.rb

INSERT INTO "users" ("DOB", "address", "breakdownCover", "created_at", "currentLicenseType", "email", "estimatedAnnualMileage", "estimatedVehicleValue", "licensePeriod", "name", "numberOfIncidents", "occupation", "policyExcess", "policyStartDate", "surname", "telephoneNumber", "title", "typicalParkingLocation", "updated_at", "vehicleRegistration") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save